Revit 2027 API
NumberedReferenceInfo.FormattedNumber Property
 The formated number associated with this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FormattedNumber { get; }
Public ReadOnly Property FormattedNumber As String
	Get
public:
property String^ FormattedNumber {
	String^ get ();
}
member FormattedNumber : string with get
Property Value
String
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace